Tekla Open API Reference for Tekla Structures 2025
BasePoint.ConvertFromBasePoint Method (Point)
 Converts the given point from this base point to local point.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point ConvertFromBasePoint(
	Point point
)
Public Function ConvertFromBasePoint (
	point As Point
) As Point
Parameters
point
Type: Tekla.Structures.Geometry3d.Point
The point to be converted.
Return Value
Type: Point
On success, the converted value. Otherwise the original value.
See Also
Reference
BasePoint Class
ConvertFromBasePoint Overload
Tekla.Structures.Model Namespace